#+TITLE: Computer Science I - Lecture 08
#+DATE: 2018-11-30
#+HUGO_BASE_DIR: ../../../
#+HUGO_SECTION: uni/cs1
#+HUGO_DRAFT: false
#+HUGO_AUTO_SET_LASTMOD: true


*Disclaimer:* /I was not able to attend this and next weeks lectures that take place on friday because I am required to attend some course at another university in another city. That means that the blog posts 7th and 8th Computer Science I lecture and the blog posts to the 14th and 16th Algorithms & Programming lecture is not supplemented by the notes I usually take during the lecture. Also the slides that I cover in each post may be a bit off from what was actually covered (especially in CS01 because I "guess" what we covered, while for A&P a classmate hands me the covered slides)/

** Scope
Variables that are declared
- outside of any functions are visible/present/accessible until the end of the source code
- inside of functions (or as function parameters) are visible/present/accessible until the end of that function
- inside of blocks (={...}=) are visible/present/accessible until the end of that block
  
#+BEGIN_SRC C++ exports: both results: output print
  #include <iostream>
  using namespace std;

  int x;  // outside of any function

  void f1() {
    int x; // inside of f1
    x = 7;
    cout << x << endl;
  }

  int main() {
    x = 5;
    f1();
    cout << x;
  }
#+END_SRC

#+RESULTS:
| 7 |
| 5 |

The two =x='s in the code above have their own, different places in memory.

Beware that while it is possible to declare the same name in different scopes is possible, it is not really recommended.

